Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem Methods
The UserPropertyItem type exposes the following members.
Methods
Name | Description
AddToObjectType
 Adds the user property item to the given object type.
Delete
 Deletes the user property item from the database.
GetDefaultValue(Double)
 Gets the default value of a double property.
GetDefaultValue(Int32)
 Gets the default value of an integer property.
GetDefaultValue(String)
 Gets the default value of a string property.
GetLabel()
 Gets the label of the user property. Labels are translated when translation is available.
GetLabel(Boolean)
 Gets the label of the user property.
GetObjectTypes
 Gets the object types which contain this user property item.
GetOptions(List<KeyValuePair<Double, String>>)
 Gets the value options of a double property. Option strings are translated when translation is available.
GetOptions(List<KeyValuePair<Int32, String>>)
 Gets the value options of an integer property. Option strings are translated when translation is available.
GetOptions(List<KeyValuePair<String, String>>)
 Gets the value options of a string property. Option strings are translated when translation is available.
GetOptions(List<KeyValuePair<Double, String>>, Boolean)
 Gets the value options of a double property.
GetOptions(List<KeyValuePair<Int32, String>>, Boolean)
 Gets the value options of an integer property.
GetOptions(List<KeyValuePair<String, String>>, Boolean)
 Gets the value options of a string property.
Insert
 Inserts the user property item to the database.
Modify
 Modifies the user property item.
RemoveFromObjectType
 Removes the user property item from the given object type.
Select
 Selects by name the user property item from the database.
SetDefaultValue(Double)
 Sets the default value of a double property.
SetDefaultValue(Int32)
 Sets the default value of an integer property.
SetDefaultValue(String)
 Sets the default value of a string property.
SetLabel
 Sets the label of the user property.
SetOptions(List<KeyValuePair<Double, String>>)
 Sets the value options of a double property. The maximum count of options is 400.
SetOptions(List<KeyValuePair<Int32, String>>)
 Sets the value options of an integer property. The maximum count of options is 400.
SetOptions(List<KeyValuePair<String, String>>)
 Sets the value options of a string property. The maximum count of options is 400.
Top
See Also
Reference
UserPropertyItem Class
Tekla.Structures.Catalogs Namespace